#+TITLE:Writing Your Own Functions - PRACTICE FILE
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE:DSC205 Introduction to Advanced Data Science
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :exports both :results output :session *R* :noweb yes
* TODO Adding arguments

- Modify ~myfib~ to take a single argument, ~threshold~, to ~break~ off the
  generator (e.g. ~threshold=150~):
  1) modify the code block "fib_threshold" below accordingly.
  2) create a code block for ~myfib2~ that takes the ~threshold~ argument
  3) ~return~ the result ~fib~
  4) search the list of user-defined objects for "myfib2"
  5) Run ~myfib2~ for different values of ~threshold~: {150, 250,
     100000, 1000000}

  Create a code block to initialized the sequence:
  #+name: initialize_fibonacci
  #+begin_src R :results silent
    fib <- rep(NA,10);
    fib[2] <- fib[1] <- 1;
    i = 2
    threshold <- 1
  #+end_src

  When you use ~threshold~, this code block is no longer executable
  #+name: fib_threshold
  #+begin_src R :results silent
    <<initialize_fibonacci>>
    repeat { i <- i + 1 # count up
      append(fib,fib[i] <- fib[i-2] + fib[i-1])
      if (fib[i] > threshold) break # break for values > threshold
    }
  #+end_src

  #+begin_src R
    myfib2 <- function(threshold) {
      <<fib_threshold>>
    }
    myfib2(threshold=150)
  #+end_src

  #+RESULTS:
  :  [1]  1  1  2 NA NA NA NA NA NA NA

- Print only those results of ~myfib2(1e6)~ that are greater than 150
  and smaller than 500,000:
  1) Save ~myfib2(threshold=1e6)~ in an object ~foo~
  2) Subset ~foo~ accordingly
  #+begin_src R
    ## your solution here
  #+end_src

